1.	მონიშნეთ არასწორი წინადადება
a. CTE - ში შეიძლება ახალი CTE იყოს განსაზღვრული (სწორია)
b.	CTE - ს ტანში შეგვიძლია გამოვიყენოთ UNION,UNION ALL, EXPECT, INTERSECT
c.	CTE შეგვიძლია გამოვიყენოთ ვიუში
d.	სხვა სერვერზე არსებული ცხრილი შეგვიძლია გამოვიყენოთ CTE - ში
2.	მონიშნეთ არასწორი წინადადება
a.	CTE - ს შეიძლება მოყვებოდეს DELETE
b.	CTE - ს შეიძლება მოყვებოდეს TRUNCATE (სწორია)
c.	CTE - ს შეიძლება მოყვებოდეს UPDATE
d.	CTE - ს შეიძლება მოყვებოდეს მხოლოდ DML ბრძანებები
3.	მონიშნეთ არასწორი წინადადება პროცედურების შესახებ
a.	პროცედურებში შეგვიძლია CTE - ების გამოყენება
b.	პროცედურებში შეგვიძლია TRY...CATCH ის გამოყენება
c.	პროცედურებში არ შეგვიძლია ლოკალური დროებითი ცხრილის გამოყენება (სწორია)
d.	პროცედურებში შეგვიძლია While...End ის გამოყენება

1.	Try - Catch ბლოკის გამოყენება შეგვიძლია
a.	პროცედურაში (სწორია)
b.	სკალარულ ფუნქციაში
c.	ცხრილურ ფუნქციაში
d.	ყველა პასუხი სწორია
2.	როგორ შეგვიძლია დაუქომითებელი მონაცემების წაკითხვა სხვა სესიიდან (Query-დან) ?
a.	ცხრილზე NOLOCK ბრძანების მითითებით
b.	SET TRAN ISOLATION LEVEL READ UNCOMMITTED ბრძანების დაწერით სელექთამდე
c.	NOLOCK ით ან SET TRAN ISOLATION LEVEL READ UNCOMMITTED ბრძანების
დაწერით სელექთამდე (სწორია)
d.	სხვა სესიიდან დაუქომითებელ მონაცემებს ვერ წავიკითხავთ
3.	Case When ბრძანება შეგვიძლია გამოვიყენოთ
a.	SELECT, UPDATE, DELETE
b.	SET, IN
c.	WHERE, ORDER BY, GROUP BY
d.	ყველა ზემოთ ჩამოთვლილთან (სწორია)
4.	ტრანზაქციის გამოყენება შეგვიძლია
a.	მხოლოდ პროცედურებში (სწორია)
b.	ვიუებში და პროცედურებში
c.	ცხრილურ ფუნქციებში და პროცედურებში
d.	სკალარულ ფუნქციებში და პროცედურებში
5.	დროებითი ცხრილები შეგვიძლია გამოვიყენოთ
a.	მხოლოდ ცხრილურ ფუნქციებში და პროცედურებში
b.	მხოლოდ ვიუებსა და პროცედურებში
c.	მხოლოდ პროცედურებში (სწორია)
d.	მხოლოდ სკალარულ ფუნქციებსა და პროცედურებში
6.	ცხრილში გვაქვს ID სვეტი, რომლის ზოგიერთი მნიშვნელობა არის ცარიელი (NULL), ქვემოთ მოცემული წინადადებებიდან რომელი იქნება სწორი
a.	ორივე დააბრუნებს ცხრილში სტრიქონების რაოდენობას
b.	ორივე დააბრუნებს ცხრილში არაცარიელი სტრიქონების რაოდენობას
c.	COUNT(*) დააბრუნებს არაცარიელი სტრიქონების რაოდენობას, ხოლო COUNT(ID) მხოლოდ ყველა სტრიქონის რაოდენობას
d.	COUNT(*) დააბრუნებს სტრიქონების რაოდენობას, მიუხედავად იმისა ცარიელი იქნება თუ შევსებული, ხოლო COUNT(ID) მხოლოდ არაცარიელი სტრიქონების რაოდენობას (სწორია)
 
1.	რომელი ტიპის ფუნქციაში შეგვიძლია განვსაზღვროთ დასაბრუნებელი ცხრილის სტრუქტურა?
a.	Scalar
b.	Inline Table-valued
c.	MSTVF (სწორია) 
d.	არც ერთში
2.	ორ თარიღს შორის (20190101 , 20191013) დღეების რაოდენობას სწორად გამოიტანს შემდეგი ფორმულა
a.	SELECT DATEDIFF(dd,'20190101','20191013') (სწორია)
b.	SELECT DATEDIFF(dd,'20191013','20190101')
c.	SELECT DATEDIFF(ddd,'20191013','20190101')
d.	SELECT DATEDIFF(ww,'20190101','20191013')
3.	COALESCE ფუნქცია გვიბრუნებს
a.	მხოლოდ რიცხვით მნიშვნელობას
b.	პირველივე რიცხვით მნიშვნელობას
c.	პირველივე არაცარიელ მნიშვნელობას (სწორია)
d.	არც ერთი პასუხი არ არის სწორი
4.	რას დაგვიბრუნებს შემდეგი ფუნქცია Select Nullif (SQRT(25),ABS(-5))

a.	1
b.	0
c.	5
d.	NULL (სწორია)
5.	როდესაც გვაქვს 1:1 კავშირი, ასეთ შემთხვევაში მონაცემები უნდა ჩავწეროთ
a.	ორ ცხრილში, სადაც ერთში გვექნება პირველადი გადასაღები და მეორე ცხრილს დავუკავშირებთ მეორადი გასაღებით
b.	ერთ ცხრილში (სწორია)
c.	შემოვიღოთ კავშირის ცხრილი, რომელიც იქნება მესამე ცხრილი და დაუკავშირდება თითოეულ ცხრილს ცალ-ცალკე
d.	გააჩნია შემთხვევას

1.	101.163 რიცხვის დამრგვალებისას იგივე რიცხვის მიღება (101.163) რომელი ფუნქციით არის შესაძლებელი?
a.	Round() (სწორია)
b.	Floor()
c.	Ceiling()
d.	სამივე პასუხი სწორია
2.	რა შედეგს დაგვიბრუნებს შემდეგი ბრძანება? Select Charindex(‘a’,’ABCabcGaKaHa’,4)

a.  4 (სწორია)
b.  0
c.	9
d.  5
3.	პირველ ცხრილში გვაქვს 3 ჩანაწერი (Row), მეორეში 11, რომელი ტიპით დაკავშირება დაგვიბრუნებს 33 ჩანაწერს
a.	FULL JOIN
b.	FULL JOIN - იმ შემთხვევაში თუ გადაბმის პირობაში არც ერთი პირობა არ ჩაჯდება, ანუ არ გადაებმევა
c.	CROSS JOIN (სწორია)
d.	სწორი პასუხებია - CROSS JOIN და FULL JOIN - იმ შემთხვევაში თუ გადაბმის პირობაში არც ერთი პირობა არ ჩაჯდება, ანუ არ გადაებმევა
4.	სიმრავლეებზე მანიპულირებისას, იმას თუ რომელი ცხრილი ეწერება პირველი და რომელი მეორე შედეგზე გავლენა შეიძლება მოხდინოს შემდეგი ბრძანებისთვის
a.	UNION ALL
b.	EXCEPT (სწორია)
c.	INTERSECT
d.	UNION
5.	რა შედეგს დაგვიბრუნებს შემდეგი სკრიპტი Select ASCII(UPPER(LOWER(‘[A]’)))

a.	A ს შესაბამის ASCII კოდს
b.	a ს შესაბამის ASCII კოდს
c.	[ სიმბოლოს შესაბამის ASCII კოდს (სწორია)
d.	NULL - ს

1.	სკალარული ფუნქცია აბრუნებს
a.	მხოლოდ რიცხვით მნიშვნელობებს
b.	ცხრილს
c.	ერთ მნიშვნელობას, გარდა date, text, cursor, image, timestamp
d.	არც ერთი პასუხი არ არის სწორი (სწორია)
2.	რომელი ტიპის ფუნქციის სინტაქსში არ გამოიყენება BEGIN ... END ბრძანებები?
a.	Scalar
b.	Inline Table-valued (სწორია)
c.	MSTVF
d.	ყველაში გამოიყენება
3.	რომელ ტიპის ფუნქციას შეიძლება რომ არ ჰქონდეს input პარამეტრი?
a.	Inline Table-valued function
b.	Multi-statement table-valued functions
c.	სამივე პასუხი სწორია (სწორია)
d.	Scalar Functions
4.	რა შეზღუდვებს ადებს Primary Key ველს?
a.	UNIQUE, IDENTITY, NOT NULL
b.	UNIQUE, CHECK,
c.	NOT NULL, UNIQUE (სწორია)
d.	IDENTITY, NOT NULL
5.	რომელი
